RIET/src/Catalogs/UOMs/UOMs.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>UOMs</name>
  <predefined>
    <items>
      <name>CM</name>
      <description>centimeter</description>
    </items>
    <items>
      <name>KG</name>
      <description>kilogram</description>
    </items>
    <items>
      <name>LT</name>
      <description>liter</description>
    </items>
    <items>
      <name>N_A</name>
      <description>non applicable</description>
    </items>
    <items>
      <name>SCM</name>
      <description>standard cubic meter</description>
    </items>
    <items>
      <name>SM</name>
      <description>square metre</description>
    </items>
  </predefined>
  <attributes>
    <name>Standard</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>StandardUOM</name>
    <type>
      <types>CatalogRef.UOMs</types>
    </type>
  </attributes>
  <attributes>
    <name>ConversionFactor</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BasicUOM</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>TMSId</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TMSIdForItemUOM</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>InTMS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>NameRus</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>NameRusFilled</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

RIET/src/Catalogs/UOMs/Forms/ФормаЭлемента/Module.bsl
////////////////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ
 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ConversionFactor.Доступность = НЕ Объект.Standard;
    Элементы.StandardUOM.Доступность = НЕ Объект.Standard;
	
КонецПроцедуры 

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ModifiedBy = ПараметрыСеанса.ТекущийПользователь;
	ТекущийОбъект.ModificationDate = ТекущаяДата();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ

&НаКлиенте
Процедура StandardUOMНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Standard", Истина);
	ПараметрыОтбора.Вставить("ПометкаУдаления", Ложь);
	
	ПараметрыФормы = Новый Структура("Отбор", ПараметрыОтбора);	
	ОткрытьФорму("Справочник.UOMs.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура StandardПриИзменении(Элемент)
		
	Элементы.ConversionFactor.Доступность = НЕ Объект.Standard;
    Элементы.StandardUOM.Доступность = НЕ Объект.Standard;	
	
КонецПроцедуры
